HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxAmu_bf.h
/**
 * \file IfxAmu_bf.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC37x_TS_V2.6.0.R0
 * Specification: TC3xx Target Specification.V2.6.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Amu_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Amu_Registers
 * 
 */
#ifndef IFXAMU_BF_H
#define IFXAMU_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Amu_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_AMU_CTRL1_Bits.EXPFIX */
#define IFX_AMU_CTRL1_EXPFIX_LEN (7u)

/** \brief Mask for Ifx_AMU_CTRL1_Bits.EXPFIX */
#define IFX_AMU_CTRL1_EXPFIX_MSK (0x7fu)

/** \brief Offset for Ifx_AMU_CTRL1_Bits.EXPFIX */
#define IFX_AMU_CTRL1_EXPFIX_OFF (0u)

/** \brief Length for Ifx_AMU_CTRL1_Bits.VFRMT */
#define IFX_AMU_CTRL1_VFRMT_LEN (2u)

/** \brief Mask for Ifx_AMU_CTRL1_Bits.VFRMT */
#define IFX_AMU_CTRL1_VFRMT_MSK (0x3u)

/** \brief Offset for Ifx_AMU_CTRL1_Bits.VFRMT */
#define IFX_AMU_CTRL1_VFRMT_OFF (16u)

/** \brief Length for Ifx_AMU_CTRL1_Bits.CFGSET */
#define IFX_AMU_CTRL1_CFGSET_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL1_Bits.CFGSET */
#define IFX_AMU_CTRL1_CFGSET_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL1_Bits.CFGSET */
#define IFX_AMU_CTRL1_CFGSET_OFF (18u)

/** \brief Length for Ifx_AMU_EER_Bits.P7MAX */
#define IFX_AMU_EER_P7MAX_LEN (1u)

/** \brief Mask for Ifx_AMU_EER_Bits.P7MAX */
#define IFX_AMU_EER_P7MAX_MSK (0x1u)

/** \brief Offset for Ifx_AMU_EER_Bits.P7MAX */
#define IFX_AMU_EER_P7MAX_OFF (0u)

/** \brief Length for Ifx_AMU_EER_Bits.IINF */
#define IFX_AMU_EER_IINF_LEN (1u)

/** \brief Mask for Ifx_AMU_EER_Bits.IINF */
#define IFX_AMU_EER_IINF_MSK (0x1u)

/** \brief Offset for Ifx_AMU_EER_Bits.IINF */
#define IFX_AMU_EER_IINF_OFF (1u)

/** \brief Length for Ifx_AMU_EER_Bits.INAN */
#define IFX_AMU_EER_INAN_LEN (1u)

/** \brief Mask for Ifx_AMU_EER_Bits.INAN */
#define IFX_AMU_EER_INAN_MSK (0x1u)

/** \brief Offset for Ifx_AMU_EER_Bits.INAN */
#define IFX_AMU_EER_INAN_OFF (2u)

/** \brief Length for Ifx_AMU_EER_Bits.OOV */
#define IFX_AMU_EER_OOV_LEN (1u)

/** \brief Mask for Ifx_AMU_EER_Bits.OOV */
#define IFX_AMU_EER_OOV_MSK (0x1u)

/** \brief Offset for Ifx_AMU_EER_Bits.OOV */
#define IFX_AMU_EER_OOV_OFF (3u)

/** \brief Length for Ifx_AMU_EER_Bits.ME */
#define IFX_AMU_EER_ME_LEN (1u)

/** \brief Mask for Ifx_AMU_EER_Bits.ME */
#define IFX_AMU_EER_ME_MSK (0x1u)

/** \brief Offset for Ifx_AMU_EER_Bits.ME */
#define IFX_AMU_EER_ME_OFF (4u)

/** \brief Length for Ifx_AMU_EER_Bits.REGACC */
#define IFX_AMU_EER_REGACC_LEN (1u)

/** \brief Mask for Ifx_AMU_EER_Bits.REGACC */
#define IFX_AMU_EER_REGACC_MSK (0x1u)

/** \brief Offset for Ifx_AMU_EER_Bits.REGACC */
#define IFX_AMU_EER_REGACC_OFF (5u)

/** \brief Length for Ifx_AMU_EER_Bits.DENORM */
#define IFX_AMU_EER_DENORM_LEN (1u)

/** \brief Mask for Ifx_AMU_EER_Bits.DENORM */
#define IFX_AMU_EER_DENORM_MSK (0x1u)

/** \brief Offset for Ifx_AMU_EER_Bits.DENORM */
#define IFX_AMU_EER_DENORM_OFF (6u)

/** \brief Length for Ifx_AMU_EER_Bits.ECC_STOP */
#define IFX_AMU_EER_ECC_STOP_LEN (1u)

/** \brief Mask for Ifx_AMU_EER_Bits.ECC_STOP */
#define IFX_AMU_EER_ECC_STOP_MSK (0x1u)

/** \brief Offset for Ifx_AMU_EER_Bits.ECC_STOP */
#define IFX_AMU_EER_ECC_STOP_OFF (15u)

/** \brief Length for Ifx_AMU_EER_Bits.DENEN */
#define IFX_AMU_EER_DENEN_LEN (1u)

/** \brief Mask for Ifx_AMU_EER_Bits.DENEN */
#define IFX_AMU_EER_DENEN_MSK (0x1u)

/** \brief Offset for Ifx_AMU_EER_Bits.DENEN */
#define IFX_AMU_EER_DENEN_OFF (22u)

/** \brief Length for Ifx_AMU_EER_Bits.EECN */
#define IFX_AMU_EER_EECN_LEN (1u)

/** \brief Mask for Ifx_AMU_EER_Bits.EECN */
#define IFX_AMU_EER_EECN_MSK (0x1u)

/** \brief Offset for Ifx_AMU_EER_Bits.EECN */
#define IFX_AMU_EER_EECN_OFF (23u)

/** \brief Length for Ifx_AMU_P10SINT_Bits.NCROSSING */
#define IFX_AMU_P10SINT_NCROSSING_LEN (16u)

/** \brief Mask for Ifx_AMU_P10SINT_Bits.NCROSSING */
#define IFX_AMU_P10SINT_NCROSSING_MSK (0xffffu)

/** \brief Offset for Ifx_AMU_P10SINT_Bits.NCROSSING */
#define IFX_AMU_P10SINT_NCROSSING_OFF (0u)

/** \brief Length for Ifx_AMU_P6SINT_Bits.NEND */
#define IFX_AMU_P6SINT_NEND_LEN (16u)

/** \brief Mask for Ifx_AMU_P6SINT_Bits.NEND */
#define IFX_AMU_P6SINT_NEND_MSK (0xffffu)

/** \brief Offset for Ifx_AMU_P6SINT_Bits.NEND */
#define IFX_AMU_P6SINT_NEND_OFF (0u)

/** \brief Length for Ifx_AMU_P7SINT_Bits.M */
#define IFX_AMU_P7SINT_M_LEN (16u)

/** \brief Mask for Ifx_AMU_P7SINT_Bits.M */
#define IFX_AMU_P7SINT_M_MSK (0xffffu)

/** \brief Offset for Ifx_AMU_P7SINT_Bits.M */
#define IFX_AMU_P7SINT_M_OFF (0u)

/** \brief Length for Ifx_AMU_P8SINT_Bits.NSTART */
#define IFX_AMU_P8SINT_NSTART_LEN (16u)

/** \brief Mask for Ifx_AMU_P8SINT_Bits.NSTART */
#define IFX_AMU_P8SINT_NSTART_MSK (0xffffu)

/** \brief Offset for Ifx_AMU_P8SINT_Bits.NSTART */
#define IFX_AMU_P8SINT_NSTART_OFF (0u)

/** \brief Length for Ifx_AMU_P9DOUBLELOW32_Bits.P9DOUBLE */
#define IFX_AMU_P9DOUBLELOW32_P9DOUBLE_LEN (32u)

/** \brief Mask for Ifx_AMU_P9DOUBLELOW32_Bits.P9DOUBLE */
#define IFX_AMU_P9DOUBLELOW32_P9DOUBLE_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_P9DOUBLELOW32_Bits.P9DOUBLE */
#define IFX_AMU_P9DOUBLELOW32_P9DOUBLE_OFF (0u)

/** \brief Length for Ifx_AMU_P9DOUBLEHIGH32_Bits.P9DOUBLE */
#define IFX_AMU_P9DOUBLEHIGH32_P9DOUBLE_LEN (32u)

/** \brief Mask for Ifx_AMU_P9DOUBLEHIGH32_Bits.P9DOUBLE */
#define IFX_AMU_P9DOUBLEHIGH32_P9DOUBLE_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_P9DOUBLEHIGH32_Bits.P9DOUBLE */
#define IFX_AMU_P9DOUBLEHIGH32_P9DOUBLE_OFF (0u)

