HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxAmu_bf.h
/** \brief Length for Ifx_AMU_VPFLOAT_Bits.VPFLOAT */
#define IFX_AMU_VPFLOAT_VPFLOAT_LEN (32u)

/** \brief Mask for Ifx_AMU_VPFLOAT_Bits.VPFLOAT */
#define IFX_AMU_VPFLOAT_VPFLOAT_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_VPFLOAT_Bits.VPFLOAT */
#define IFX_AMU_VPFLOAT_VPFLOAT_OFF (0u)

/** \brief Length for Ifx_AMU_LPFLOAT_Bits.LPFLOAT */
#define IFX_AMU_LPFLOAT_LPFLOAT_LEN (32u)

/** \brief Mask for Ifx_AMU_LPFLOAT_Bits.LPFLOAT */
#define IFX_AMU_LPFLOAT_LPFLOAT_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_LPFLOAT_Bits.LPFLOAT */
#define IFX_AMU_LPFLOAT_LPFLOAT_OFF (0u)

/** \brief Length for Ifx_AMU_P1PFLOAT_Bits.P1PFLOAT */
#define IFX_AMU_P1PFLOAT_P1PFLOAT_LEN (32u)

/** \brief Mask for Ifx_AMU_P1PFLOAT_Bits.P1PFLOAT */
#define IFX_AMU_P1PFLOAT_P1PFLOAT_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_P1PFLOAT_Bits.P1PFLOAT */
#define IFX_AMU_P1PFLOAT_P1PFLOAT_OFF (0u)

/** \brief Length for Ifx_AMU_P2PFLOAT_Bits.P2PFLOAT */
#define IFX_AMU_P2PFLOAT_P2PFLOAT_LEN (32u)

/** \brief Mask for Ifx_AMU_P2PFLOAT_Bits.P2PFLOAT */
#define IFX_AMU_P2PFLOAT_P2PFLOAT_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_P2PFLOAT_Bits.P2PFLOAT */
#define IFX_AMU_P2PFLOAT_P2PFLOAT_OFF (0u)

/** \brief Length for Ifx_AMU_P3PFLOAT_Bits.P3PFLOAT */
#define IFX_AMU_P3PFLOAT_P3PFLOAT_LEN (32u)

/** \brief Mask for Ifx_AMU_P3PFLOAT_Bits.P3PFLOAT */
#define IFX_AMU_P3PFLOAT_P3PFLOAT_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_P3PFLOAT_Bits.P3PFLOAT */
#define IFX_AMU_P3PFLOAT_P3PFLOAT_OFF (0u)

/** \brief Length for Ifx_AMU_P4FLOAT_Bits.P4FLOAT */
#define IFX_AMU_P4FLOAT_P4FLOAT_LEN (32u)

/** \brief Mask for Ifx_AMU_P4FLOAT_Bits.P4FLOAT */
#define IFX_AMU_P4FLOAT_P4FLOAT_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_P4FLOAT_Bits.P4FLOAT */
#define IFX_AMU_P4FLOAT_P4FLOAT_OFF (0u)

/** \brief Length for Ifx_AMU_P5FLOAT_Bits.P5FLOAT */
#define IFX_AMU_P5FLOAT_P5FLOAT_LEN (32u)

/** \brief Mask for Ifx_AMU_P5FLOAT_Bits.P5FLOAT */
#define IFX_AMU_P5FLOAT_P5FLOAT_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_P5FLOAT_Bits.P5FLOAT */
#define IFX_AMU_P5FLOAT_P5FLOAT_OFF (0u)

/** \brief Length for Ifx_AMU_UPFLOAT_Bits.UPFLOAT */
#define IFX_AMU_UPFLOAT_UPFLOAT_LEN (32u)

/** \brief Mask for Ifx_AMU_UPFLOAT_Bits.UPFLOAT */
#define IFX_AMU_UPFLOAT_UPFLOAT_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_UPFLOAT_Bits.UPFLOAT */
#define IFX_AMU_UPFLOAT_UPFLOAT_OFF (0u)

/** \brief Length for Ifx_AMU_OLCOMP_Bits.CP8H2N */
#define IFX_AMU_OLCOMP_CP8H2N_LEN (16u)

/** \brief Mask for Ifx_AMU_OLCOMP_Bits.CP8H2N */
#define IFX_AMU_OLCOMP_CP8H2N_MSK (0xffffu)

/** \brief Offset for Ifx_AMU_OLCOMP_Bits.CP8H2N */
#define IFX_AMU_OLCOMP_CP8H2N_OFF (0u)

/** \brief Length for Ifx_AMU_OLCOMP_Bits.CPHN2H */
#define IFX_AMU_OLCOMP_CPHN2H_LEN (16u)

/** \brief Mask for Ifx_AMU_OLCOMP_Bits.CPHN2H */
#define IFX_AMU_OLCOMP_CPHN2H_MSK (0xffffu)

/** \brief Offset for Ifx_AMU_OLCOMP_Bits.CPHN2H */
#define IFX_AMU_OLCOMP_CPHN2H_OFF (16u)

/** \brief Length for Ifx_AMU_CTRL0_Bits.EN */
#define IFX_AMU_CTRL0_EN_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0_Bits.EN */
#define IFX_AMU_CTRL0_EN_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0_Bits.EN */
#define IFX_AMU_CTRL0_EN_OFF (0u)

/** \brief Length for Ifx_AMU_CTRL0_Bits.ENCN */
#define IFX_AMU_CTRL0_ENCN_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0_Bits.ENCN */
#define IFX_AMU_CTRL0_ENCN_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0_Bits.ENCN */
#define IFX_AMU_CTRL0_ENCN_OFF (1u)

/** \brief Length for Ifx_AMU_CTRL0_Bits.READY */
#define IFX_AMU_CTRL0_READY_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0_Bits.READY */
#define IFX_AMU_CTRL0_READY_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0_Bits.READY */
#define IFX_AMU_CTRL0_READY_OFF (2u)

/** \brief Length for Ifx_AMU_CTRL0_Bits.SDOWN */
#define IFX_AMU_CTRL0_SDOWN_LEN (2u)

/** \brief Mask for Ifx_AMU_CTRL0_Bits.SDOWN */
#define IFX_AMU_CTRL0_SDOWN_MSK (0x3u)

/** \brief Offset for Ifx_AMU_CTRL0_Bits.SDOWN */
#define IFX_AMU_CTRL0_SDOWN_OFF (3u)

/** \brief Length for Ifx_AMU_CTRL0_Bits.SDOWNCN */
#define IFX_AMU_CTRL0_SDOWNCN_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0_Bits.SDOWNCN */
#define IFX_AMU_CTRL0_SDOWNCN_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0_Bits.SDOWNCN */
#define IFX_AMU_CTRL0_SDOWNCN_OFF (5u)

/** \brief Length for Ifx_AMU_CTRL0_Bits.LI */
#define IFX_AMU_CTRL0_LI_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0_Bits.LI */
#define IFX_AMU_CTRL0_LI_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0_Bits.LI */
#define IFX_AMU_CTRL0_LI_OFF (6u)

/** \brief Length for Ifx_AMU_CTRL0_Bits.ERR */
#define IFX_AMU_CTRL0_ERR_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0_Bits.ERR */
#define IFX_AMU_CTRL0_ERR_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0_Bits.ERR */
#define IFX_AMU_CTRL0_ERR_OFF (7u)

/** \brief Length for Ifx_AMU_CTRL0_Bits.LIM2RDY */
#define IFX_AMU_CTRL0_LIM2RDY_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0_Bits.LIM2RDY */
#define IFX_AMU_CTRL0_LIM2RDY_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0_Bits.LIM2RDY */
#define IFX_AMU_CTRL0_LIM2RDY_OFF (8u)

/** \brief Length for Ifx_AMU_CTRL0_Bits.RDY2LIM */
#define IFX_AMU_CTRL0_RDY2LIM_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0_Bits.RDY2LIM */
#define IFX_AMU_CTRL0_RDY2LIM_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0_Bits.RDY2LIM */
#define IFX_AMU_CTRL0_RDY2LIM_OFF (9u)

/** \brief Length for Ifx_AMU_CTRL0_Bits.SL */
#define IFX_AMU_CTRL0_SL_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0_Bits.SL */
#define IFX_AMU_CTRL0_SL_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0_Bits.SL */
#define IFX_AMU_CTRL0_SL_OFF (10u)

/** \brief Length for Ifx_AMU_CTRL0_Bits.REGACCEN */
#define IFX_AMU_CTRL0_REGACCEN_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0_Bits.REGACCEN */
#define IFX_AMU_CTRL0_REGACCEN_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0_Bits.REGACCEN */
#define IFX_AMU_CTRL0_REGACCEN_OFF (11u)

/** \brief Length for Ifx_AMU_CTRL0_Bits.MAX */
#define IFX_AMU_CTRL0_MAX_LEN (3u)

/** \brief Mask for Ifx_AMU_CTRL0_Bits.MAX */
#define IFX_AMU_CTRL0_MAX_MSK (0x7u)

