HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxAmu_bf.h
/** \brief Offset for Ifx_AMU_CTRL0_Bits.MAX */
#define IFX_AMU_CTRL0_MAX_OFF (12u)

/** \brief Length for Ifx_AMU_CTRL0_Bits.MAXCN */
#define IFX_AMU_CTRL0_MAXCN_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0_Bits.MAXCN */
#define IFX_AMU_CTRL0_MAXCN_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0_Bits.MAXCN */
#define IFX_AMU_CTRL0_MAXCN_OFF (15u)

/** \brief Length for Ifx_AMU_CTRL0_Bits.ID */
#define IFX_AMU_CTRL0_ID_LEN (7u)

/** \brief Mask for Ifx_AMU_CTRL0_Bits.ID */
#define IFX_AMU_CTRL0_ID_MSK (0x7fu)

/** \brief Offset for Ifx_AMU_CTRL0_Bits.ID */
#define IFX_AMU_CTRL0_ID_OFF (16u)

/** \brief Length for Ifx_AMU_CTRL0_Bits.IDCN */
#define IFX_AMU_CTRL0_IDCN_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0_Bits.IDCN */
#define IFX_AMU_CTRL0_IDCN_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0_Bits.IDCN */
#define IFX_AMU_CTRL0_IDCN_OFF (23u)

/** \brief Length for Ifx_AMU_CTRL0_Bits.CSH */
#define IFX_AMU_CTRL0_CSH_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0_Bits.CSH */
#define IFX_AMU_CTRL0_CSH_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0_Bits.CSH */
#define IFX_AMU_CTRL0_CSH_OFF (24u)

/** \brief Length for Ifx_AMU_CTRL0_Bits.CSHCN */
#define IFX_AMU_CTRL0_CSHCN_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0_Bits.CSHCN */
#define IFX_AMU_CTRL0_CSHCN_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0_Bits.CSHCN */
#define IFX_AMU_CTRL0_CSHCN_OFF (25u)

/** \brief Length for Ifx_AMU_CTRL0_Bits.HSPEED */
#define IFX_AMU_CTRL0_HSPEED_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0_Bits.HSPEED */
#define IFX_AMU_CTRL0_HSPEED_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0_Bits.HSPEED */
#define IFX_AMU_CTRL0_HSPEED_OFF (26u)

/** \brief Length for Ifx_AMU_CTRL0_Bits.HSPEEDCN */
#define IFX_AMU_CTRL0_HSPEEDCN_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0_Bits.HSPEEDCN */
#define IFX_AMU_CTRL0_HSPEEDCN_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0_Bits.HSPEEDCN */
#define IFX_AMU_CTRL0_HSPEEDCN_OFF (27u)

/** \brief Length for Ifx_AMU_CTRL0_Bits.CSHS */
#define IFX_AMU_CTRL0_CSHS_LEN (2u)

/** \brief Mask for Ifx_AMU_CTRL0_Bits.CSHS */
#define IFX_AMU_CTRL0_CSHS_MSK (0x3u)

/** \brief Offset for Ifx_AMU_CTRL0_Bits.CSHS */
#define IFX_AMU_CTRL0_CSHS_OFF (30u)

/** \brief Length for Ifx_AMU_ZDOUBLELOW32_Bits.ZDOUBLE */
#define IFX_AMU_ZDOUBLELOW32_ZDOUBLE_LEN (32u)

/** \brief Mask for Ifx_AMU_ZDOUBLELOW32_Bits.ZDOUBLE */
#define IFX_AMU_ZDOUBLELOW32_ZDOUBLE_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_ZDOUBLELOW32_Bits.ZDOUBLE */
#define IFX_AMU_ZDOUBLELOW32_ZDOUBLE_OFF (0u)

/** \brief Length for Ifx_AMU_ZDOUBLEHIGH32_Bits.ZDOUBLE */
#define IFX_AMU_ZDOUBLEHIGH32_ZDOUBLE_LEN (32u)

/** \brief Mask for Ifx_AMU_ZDOUBLEHIGH32_Bits.ZDOUBLE */
#define IFX_AMU_ZDOUBLEHIGH32_ZDOUBLE_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_ZDOUBLEHIGH32_Bits.ZDOUBLE */
#define IFX_AMU_ZDOUBLEHIGH32_ZDOUBLE_OFF (0u)

/** \brief Length for Ifx_AMU_ZFLOAT_Bits.ZFLOAT */
#define IFX_AMU_ZFLOAT_ZFLOAT_LEN (32u)

/** \brief Mask for Ifx_AMU_ZFLOAT_Bits.ZFLOAT */
#define IFX_AMU_ZFLOAT_ZFLOAT_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_ZFLOAT_Bits.ZFLOAT */
#define IFX_AMU_ZFLOAT_ZFLOAT_OFF (0u)

/** \brief Length for Ifx_AMU_CTRL0MIR_Bits.EN */
#define IFX_AMU_CTRL0MIR_EN_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0MIR_Bits.EN */
#define IFX_AMU_CTRL0MIR_EN_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0MIR_Bits.EN */
#define IFX_AMU_CTRL0MIR_EN_OFF (0u)

/** \brief Length for Ifx_AMU_CTRL0MIR_Bits.READY */
#define IFX_AMU_CTRL0MIR_READY_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0MIR_Bits.READY */
#define IFX_AMU_CTRL0MIR_READY_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0MIR_Bits.READY */
#define IFX_AMU_CTRL0MIR_READY_OFF (2u)

/** \brief Length for Ifx_AMU_CTRL0MIR_Bits.SDOWN */
#define IFX_AMU_CTRL0MIR_SDOWN_LEN (2u)

/** \brief Mask for Ifx_AMU_CTRL0MIR_Bits.SDOWN */
#define IFX_AMU_CTRL0MIR_SDOWN_MSK (0x3u)

/** \brief Offset for Ifx_AMU_CTRL0MIR_Bits.SDOWN */
#define IFX_AMU_CTRL0MIR_SDOWN_OFF (3u)

/** \brief Length for Ifx_AMU_CTRL0MIR_Bits.LI */
#define IFX_AMU_CTRL0MIR_LI_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0MIR_Bits.LI */
#define IFX_AMU_CTRL0MIR_LI_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0MIR_Bits.LI */
#define IFX_AMU_CTRL0MIR_LI_OFF (6u)

/** \brief Length for Ifx_AMU_CTRL0MIR_Bits.ERR */
#define IFX_AMU_CTRL0MIR_ERR_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0MIR_Bits.ERR */
#define IFX_AMU_CTRL0MIR_ERR_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0MIR_Bits.ERR */
#define IFX_AMU_CTRL0MIR_ERR_OFF (7u)

/** \brief Length for Ifx_AMU_CTRL0MIR_Bits.LIM2RDY */
#define IFX_AMU_CTRL0MIR_LIM2RDY_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0MIR_Bits.LIM2RDY */
#define IFX_AMU_CTRL0MIR_LIM2RDY_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0MIR_Bits.LIM2RDY */
#define IFX_AMU_CTRL0MIR_LIM2RDY_OFF (8u)

/** \brief Length for Ifx_AMU_CTRL0MIR_Bits.RDY2LIM */
#define IFX_AMU_CTRL0MIR_RDY2LIM_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0MIR_Bits.RDY2LIM */
#define IFX_AMU_CTRL0MIR_RDY2LIM_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0MIR_Bits.RDY2LIM */
#define IFX_AMU_CTRL0MIR_RDY2LIM_OFF (9u)

/** \brief Length for Ifx_AMU_CTRL0MIR_Bits.SL */
#define IFX_AMU_CTRL0MIR_SL_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0MIR_Bits.SL */
#define IFX_AMU_CTRL0MIR_SL_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0MIR_Bits.SL */
#define IFX_AMU_CTRL0MIR_SL_OFF (10u)

/** \brief Length for Ifx_AMU_CTRL0MIR_Bits.REGACCEN */
#define IFX_AMU_CTRL0MIR_REGACCEN_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0MIR_Bits.REGACCEN */
#define IFX_AMU_CTRL0MIR_REGACCEN_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0MIR_Bits.REGACCEN */
#define IFX_AMU_CTRL0MIR_REGACCEN_OFF (11u)

/** \brief Length for Ifx_AMU_CTRL0MIR_Bits.MAX */
#define IFX_AMU_CTRL0MIR_MAX_LEN (3u)

/** \brief Mask for Ifx_AMU_CTRL0MIR_Bits.MAX */
#define IFX_AMU_CTRL0MIR_MAX_MSK (0x7u)

/** \brief Offset for Ifx_AMU_CTRL0MIR_Bits.MAX */
#define IFX_AMU_CTRL0MIR_MAX_OFF (12u)

/** \brief Length for Ifx_AMU_CTRL0MIR_Bits.ID */
#define IFX_AMU_CTRL0MIR_ID_LEN (7u)

/** \brief Mask for Ifx_AMU_CTRL0MIR_Bits.ID */
#define IFX_AMU_CTRL0MIR_ID_MSK (0x7fu)

/** \brief Offset for Ifx_AMU_CTRL0MIR_Bits.ID */
#define IFX_AMU_CTRL0MIR_ID_OFF (16u)

