HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxAmu_bf.h
/** \brief Length for Ifx_AMU_CTRL0MIR_Bits.CSH */
#define IFX_AMU_CTRL0MIR_CSH_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0MIR_Bits.CSH */
#define IFX_AMU_CTRL0MIR_CSH_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0MIR_Bits.CSH */
#define IFX_AMU_CTRL0MIR_CSH_OFF (24u)

/** \brief Length for Ifx_AMU_CTRL0MIR_Bits.HSPEED */
#define IFX_AMU_CTRL0MIR_HSPEED_LEN (1u)

/** \brief Mask for Ifx_AMU_CTRL0MIR_Bits.HSPEED */
#define IFX_AMU_CTRL0MIR_HSPEED_MSK (0x1u)

/** \brief Offset for Ifx_AMU_CTRL0MIR_Bits.HSPEED */
#define IFX_AMU_CTRL0MIR_HSPEED_OFF (26u)

/** \brief Length for Ifx_AMU_CTRL0MIR_Bits.CSHS */
#define IFX_AMU_CTRL0MIR_CSHS_LEN (2u)

/** \brief Mask for Ifx_AMU_CTRL0MIR_Bits.CSHS */
#define IFX_AMU_CTRL0MIR_CSHS_MSK (0x3u)

/** \brief Offset for Ifx_AMU_CTRL0MIR_Bits.CSHS */
#define IFX_AMU_CTRL0MIR_CSHS_OFF (30u)

/** \brief Length for Ifx_AMU_YDOUBLELOW32_Bits.YDOUBLE */
#define IFX_AMU_YDOUBLELOW32_YDOUBLE_LEN (32u)

/** \brief Mask for Ifx_AMU_YDOUBLELOW32_Bits.YDOUBLE */
#define IFX_AMU_YDOUBLELOW32_YDOUBLE_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_YDOUBLELOW32_Bits.YDOUBLE */
#define IFX_AMU_YDOUBLELOW32_YDOUBLE_OFF (0u)

/** \brief Length for Ifx_AMU_YDOUBLEHIGH32_Bits.YDOUBLE */
#define IFX_AMU_YDOUBLEHIGH32_YDOUBLE_LEN (32u)

/** \brief Mask for Ifx_AMU_YDOUBLEHIGH32_Bits.YDOUBLE */
#define IFX_AMU_YDOUBLEHIGH32_YDOUBLE_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_YDOUBLEHIGH32_Bits.YDOUBLE */
#define IFX_AMU_YDOUBLEHIGH32_YDOUBLE_OFF (0u)

/** \brief Length for Ifx_AMU_YFLOAT_Bits.YFLOAT */
#define IFX_AMU_YFLOAT_YFLOAT_LEN (32u)

/** \brief Mask for Ifx_AMU_YFLOAT_Bits.YFLOAT */
#define IFX_AMU_YFLOAT_YFLOAT_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_YFLOAT_Bits.YFLOAT */
#define IFX_AMU_YFLOAT_YFLOAT_OFF (0u)

/** \brief Length for Ifx_AMU_ERRSR_Bits.P7MAX */
#define IFX_AMU_ERRSR_P7MAX_LEN (1u)

/** \brief Mask for Ifx_AMU_ERRSR_Bits.P7MAX */
#define IFX_AMU_ERRSR_P7MAX_MSK (0x1u)

/** \brief Offset for Ifx_AMU_ERRSR_Bits.P7MAX */
#define IFX_AMU_ERRSR_P7MAX_OFF (0u)

/** \brief Length for Ifx_AMU_ERRSR_Bits.IINF */
#define IFX_AMU_ERRSR_IINF_LEN (1u)

/** \brief Mask for Ifx_AMU_ERRSR_Bits.IINF */
#define IFX_AMU_ERRSR_IINF_MSK (0x1u)

/** \brief Offset for Ifx_AMU_ERRSR_Bits.IINF */
#define IFX_AMU_ERRSR_IINF_OFF (1u)

/** \brief Length for Ifx_AMU_ERRSR_Bits.INAN */
#define IFX_AMU_ERRSR_INAN_LEN (1u)

/** \brief Mask for Ifx_AMU_ERRSR_Bits.INAN */
#define IFX_AMU_ERRSR_INAN_MSK (0x1u)

/** \brief Offset for Ifx_AMU_ERRSR_Bits.INAN */
#define IFX_AMU_ERRSR_INAN_OFF (2u)

/** \brief Length for Ifx_AMU_ERRSR_Bits.OOV */
#define IFX_AMU_ERRSR_OOV_LEN (1u)

/** \brief Mask for Ifx_AMU_ERRSR_Bits.OOV */
#define IFX_AMU_ERRSR_OOV_MSK (0x1u)

/** \brief Offset for Ifx_AMU_ERRSR_Bits.OOV */
#define IFX_AMU_ERRSR_OOV_OFF (3u)

/** \brief Length for Ifx_AMU_ERRSR_Bits.ME */
#define IFX_AMU_ERRSR_ME_LEN (1u)

/** \brief Mask for Ifx_AMU_ERRSR_Bits.ME */
#define IFX_AMU_ERRSR_ME_MSK (0x1u)

/** \brief Offset for Ifx_AMU_ERRSR_Bits.ME */
#define IFX_AMU_ERRSR_ME_OFF (4u)

/** \brief Length for Ifx_AMU_ERRSR_Bits.REGACC */
#define IFX_AMU_ERRSR_REGACC_LEN (1u)

/** \brief Mask for Ifx_AMU_ERRSR_Bits.REGACC */
#define IFX_AMU_ERRSR_REGACC_MSK (0x1u)

/** \brief Offset for Ifx_AMU_ERRSR_Bits.REGACC */
#define IFX_AMU_ERRSR_REGACC_OFF (5u)

/** \brief Length for Ifx_AMU_ERRSR_Bits.DENORM */
#define IFX_AMU_ERRSR_DENORM_LEN (1u)

/** \brief Mask for Ifx_AMU_ERRSR_Bits.DENORM */
#define IFX_AMU_ERRSR_DENORM_MSK (0x1u)

/** \brief Offset for Ifx_AMU_ERRSR_Bits.DENORM */
#define IFX_AMU_ERRSR_DENORM_OFF (6u)

/** \brief Length for Ifx_AMU_ERRSR_Bits.ALGOPOS */
#define IFX_AMU_ERRSR_ALGOPOS_LEN (4u)

/** \brief Mask for Ifx_AMU_ERRSR_Bits.ALGOPOS */
#define IFX_AMU_ERRSR_ALGOPOS_MSK (0xfu)

/** \brief Offset for Ifx_AMU_ERRSR_Bits.ALGOPOS */
#define IFX_AMU_ERRSR_ALGOPOS_OFF (8u)

/** \brief Length for Ifx_AMU_ERRSR_Bits.MEU */
#define IFX_AMU_ERRSR_MEU_LEN (1u)

/** \brief Mask for Ifx_AMU_ERRSR_Bits.MEU */
#define IFX_AMU_ERRSR_MEU_MSK (0x1u)

/** \brief Offset for Ifx_AMU_ERRSR_Bits.MEU */
#define IFX_AMU_ERRSR_MEU_OFF (13u)

/** \brief Length for Ifx_AMU_ERRSR_Bits.SRI_ECC */
#define IFX_AMU_ERRSR_SRI_ECC_LEN (1u)

/** \brief Mask for Ifx_AMU_ERRSR_Bits.SRI_ECC */
#define IFX_AMU_ERRSR_SRI_ECC_MSK (0x1u)

/** \brief Offset for Ifx_AMU_ERRSR_Bits.SRI_ECC */
#define IFX_AMU_ERRSR_SRI_ECC_OFF (15u)

/** \brief Length for Ifx_AMU_P8SINTMIR_Bits.NSTART */
#define IFX_AMU_P8SINTMIR_NSTART_LEN (16u)

/** \brief Mask for Ifx_AMU_P8SINTMIR_Bits.NSTART */
#define IFX_AMU_P8SINTMIR_NSTART_MSK (0xffffu)

/** \brief Offset for Ifx_AMU_P8SINTMIR_Bits.NSTART */
#define IFX_AMU_P8SINTMIR_NSTART_OFF (0u)

/** \brief Length for Ifx_AMU_UCURRPFLOAT_Bits.UPFLOAT */
#define IFX_AMU_UCURRPFLOAT_UPFLOAT_LEN (32u)

/** \brief Mask for Ifx_AMU_UCURRPFLOAT_Bits.UPFLOAT */
#define IFX_AMU_UCURRPFLOAT_UPFLOAT_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_UCURRPFLOAT_Bits.UPFLOAT */
#define IFX_AMU_UCURRPFLOAT_UPFLOAT_OFF (0u)

/** \brief Length for Ifx_AMU_P1CURRPFLOAT_Bits.P1PFLOAT */
#define IFX_AMU_P1CURRPFLOAT_P1PFLOAT_LEN (32u)

/** \brief Mask for Ifx_AMU_P1CURRPFLOAT_Bits.P1PFLOAT */
#define IFX_AMU_P1CURRPFLOAT_P1PFLOAT_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_P1CURRPFLOAT_Bits.P1PFLOAT */
#define IFX_AMU_P1CURRPFLOAT_P1PFLOAT_OFF (0u)

/** \brief Length for Ifx_AMU_P2CURRPFLOAT_Bits.P2PFLOAT */
#define IFX_AMU_P2CURRPFLOAT_P2PFLOAT_LEN (32u)

/** \brief Mask for Ifx_AMU_P2CURRPFLOAT_Bits.P2PFLOAT */
#define IFX_AMU_P2CURRPFLOAT_P2PFLOAT_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_P2CURRPFLOAT_Bits.P2PFLOAT */
#define IFX_AMU_P2CURRPFLOAT_P2PFLOAT_OFF (0u)

/** \brief Length for Ifx_AMU_P3CURRPFLOAT_Bits.P3PFLOAT */
#define IFX_AMU_P3CURRPFLOAT_P3PFLOAT_LEN (32u)

/** \brief Mask for Ifx_AMU_P3CURRPFLOAT_Bits.P3PFLOAT */
#define IFX_AMU_P3CURRPFLOAT_P3PFLOAT_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_P3CURRPFLOAT_Bits.P3PFLOAT */
#define IFX_AMU_P3CURRPFLOAT_P3PFLOAT_OFF (0u)

/** \brief Length for Ifx_AMU_VCURRPFLOAT_Bits.VPFLOAT */
#define IFX_AMU_VCURRPFLOAT_VPFLOAT_LEN (32u)

/** \brief Mask for Ifx_AMU_VCURRPFLOAT_Bits.VPFLOAT */
#define IFX_AMU_VCURRPFLOAT_VPFLOAT_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_VCURRPFLOAT_Bits.VPFLOAT */
#define IFX_AMU_VCURRPFLOAT_VPFLOAT_OFF (0u)

/** \brief Length for Ifx_AMU_LCURRPFLOAT_Bits.LPFLOAT */
#define IFX_AMU_LCURRPFLOAT_LPFLOAT_LEN (32u)

/** \brief Mask for Ifx_AMU_LCURRPFLOAT_Bits.LPFLOAT */
#define IFX_AMU_LCURRPFLOAT_LPFLOAT_MSK (0xffffffffu)

/** \brief Offset for Ifx_AMU_LCURRPFLOAT_Bits.LPFLOAT */
#define IFX_AMU_LCURRPFLOAT_LPFLOAT_OFF (0u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXAMU_BF_H */
